;void itoa(num, buff, size, radix, flag);
;numから変換。buffは保存先バッファアドレス。sizeは保存先バッファサイズ。radixは基数(n進数).
;flagはビット定義のフラグ。B2 : 空白を0で埋める。B1 : +/-記号を付ける。B0:値を符号付き変数として扱う。
        ;-------------------------------
        ; 符号付き判定
        ;-------------------------------
        test    bx, 0b0001              ; if(flags & 0x01) //符号付き
.10Q:   je      .10E                    ; {
        cmp     ax, 0                   ;   if (val < 0)
.12Q:   jge     .12E                    ;   {
        or      bx, 0b0010              ;       flags |= 2; //符号表示
.12E:                                   ;   }
.10E:                                   ; }
        ;-------------------------------
        ; 符号付き判定
        ;-------------------------------