memcpy:
        ;-----------------------
        ;【スタックフレームの構築】
        ;-----------------------
                                ;BP+8|バイト数
                                ;BP+6|コピー元
                                ;BP+4|コピー先
                                ;----|-------
        push bp                 ;BP+2|IP(戻り番地)
        mov bp, sp              ;BP+0|BP(元の値)
                                ;----|-------
        ;-----------------------
        ;【レジスタの保存】
        ;-----------------------
        push cx
        push si
        push di

        ;-----------------------
        ; バイト単位でのコピー
        ;-----------------------
        cld                     ;DF = 0; //+方向
        mov di, [bp +  8]     ;EDI = コピー先;
        mov si, [bp + 12]     ;EDI = コピー元;
        mov cx, [bp + 16]     ;EDI = バイト数;

        rep movsb               ; while (*EDI++ = +ESI++) ;

        ;-----------------------
        ; 【レジスタの復帰】
        ;-----------------------
        pop di
        pop si
        pop cx

        ;------------------------
        ; 【スタックフレームの破棄】
        ;------------------------
        mov sp, bp
        pop bp

        ret